# ShowNewTileDialog

## Description
Displays the new tile dialog.

```pascal
FUNCTION ShowNewTileDialog : HANDLE;
```

```python
def vs.ShowNewTileDialog():
    return HANDLE
```

## Examples
```pascal
tileHandle := ShowNewTileDialog;
```

```pascal
resultH := ShowNewTileDialog;
```
```python
import vs

# Displays the new tile dialog.
objHandle = vs.ShowNewTileDialog()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Dialogs - Modern